In [14]:
import pandas as pd
a=pd.DataFrame({'id': [1, 2, 3], 'name': ['Alice', 'Bob', 'Charlie']})
b=pd.DataFrame({'id': [25, 30, 35], 'name': ['Delhi', 'Mumbai', 'Chennai']})
k=pd.concat([a,b],keys=['a','b'])
k

     id     name
a 0   1    Alice
  1   2      Bob
  2   3  Charlie
b 0  25    Delhi
  1  30   Mumbai
  2  35  Chennai

In [15]:
k=pd.concat([a,b],ignore_index=True)
k

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie
3  25    Delhi
4  30   Mumbai
5  35  Chennai

In [23]:
import pandas as pd 
c= pd.DataFrame({'id': [1, 2], 'name': ['Ravi', 'Sneha']})
d= pd.DataFrame({'id': [3, 4], 'name': ['Arun', 'Priya']})
m=pd.concat([c,d],axis=1)
m

   id   name  id   name
0   1   Ravi   3   Arun
1   2  Sneha   4  Priya

In [26]:
e=pd.DataFrame({'id': [1, 2, 3], 'name': ['Asha', 'Rohit', 'Lina']})
f=pd.DataFrame({'id': [2, 3, 4], 'score': [85, 90, 75]})
k=pd.merge(e,f,on="id")
k

   id   name  score
0   2  Rohit     85
1   3   Lina     90

In [29]:
s=pd.merge(e,f,on="id",how="outer")
print("outer\n",s)
print()
t=pd.merge(e,f,on="id",how="left")
print("left",t)
print()
s=pd.merge(e,f,on="id",how="right")
print("right",s)
print()

outer
    id   name  score
0   1   Asha    NaN
1   2  Rohit   85.0
2   3   Lina   90.0
3   4    NaN   75.0

left    id   name  score
0   1   Asha    NaN
1   2  Rohit   85.0
2   3   Lina   90.0

right    id   name  score
0   2  Rohit     85
1   3   Lina     90
2   4    NaN     75